note-linux-Ubuntu开发环境的配置记录.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-13 Tue 11:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ubuntu  note</title>
<meta name="generator" content="Org mode" />

<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />

</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a>
</div>
<div id="content">
<h1 class="title">ubuntu  note</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org49ecd52">develop env conf</a></li>
<li><a href="#orgd98fb29">挂载磁盘</a></li>
<li><a href="#orgec89bce">ubuntu15.04 wifi 热点共享</a></li>
</ul>
</div>
</div>
<p>
the new os should do this for update 
</p>
<ul class="org-ul">
<li>config software sources</li>
<li>sudo apt-get update</li>
<li>sudo apt-get upgrate</li>
</ul>
<div id="outline-container-org49ecd52" class="outline-2">
<h2 id="org49ecd52">develop env conf</h2>
<div class="outline-text-2" id="text-org49ecd52">
<p>
目前想要实现的开发环境是win7环境下使用idea开发java，python
</p>

<p>
但是我想将代码，python的依赖包 安装在我的vmware ubuntu上面
</p>

<p>
实现本地使用ide开发，代码运行在远端linux上，环境使用远端环境
</p>

<p>
查看了下资料，idea官方说明有 <a href="http://www.jetbrains.com/help/idea/2017.1/remote-host-tool-window.html">sftp </a>这个功能
</p>

<p>
创建sftp服务连接 tool -&gt; deployment -&gt; + 
</p>

<p>
实现的功能：
</p>
<ol class="org-ol">
<li><p>
本地开发的java项目备份到远端linux目录
</p>

<p>
RemoteHost内配置好mappings，本地项目备份到ubuntu的路径
</p>

<p>
右键项目Upload to 服务器
</p></li>
<li><p>
使用linux python环境 写python项目
</p>

<p>
F4 -&gt; project -&gt; +  -&gt; add remote
</p>

<p>
只需要本地开发编码不报错，运行可以同步到服务器运行
</p></li>
</ol>
</div>
</div>

<div id="outline-container-orgd98fb29" class="outline-2">
<h2 id="orgd98fb29">挂载磁盘</h2>
<div class="outline-text-2" id="text-orgd98fb29">
<p>
在文件中添加要挂载的分区和文件目录可以修改文件
</p>

<p>
/etc/fstab
</p>

<p>
<i>dev/sda5</i>    media/win    ntfs    defaults   02
</p>

<p>
然后 mount -a
</p>

<ol class="org-ol">
<li><p>
查看几块硬盘
</p>

<p>
sudo fdisk -l |grep sd
</p></li>

<li><p>
创建分区
</p>

<p>
虚拟机现有20g的硬盘,使用fdisk划分磁盘
</p>

<p>
sudo fdisk /dev/sda
</p>

<p class="verse">
m  帮助信息<br />
n 创建分区<br />
e 扩展分区    +5G  pppp/pppe<br />
p 打印分区<br />
t 分区类型 L  (lvm)<br />
w 写入保存分区<br />
</p></li>

<li>格式化 分区</li>

<li>LVM
pv &#x2013;&gt; vg &#x2013;&gt; lv
参考: <a href="http://blog.sina.com.cn/s/blog_b77735d20101e5cn.html">http://blog.sina.com.cn/s/blog_b77735d20101e5cn.html</a>
<a href="http://aurthurxlc.github.io/Aurthur-2017/Centos-7-extend-lvm-volume.html">http://aurthurxlc.github.io/Aurthur-2017/Centos-7-extend-lvm-volume.html</a></li>
</ol>

<p>
#+BEGIN_SRC 
  fdisk -l | grep sd
  fdisk /dev/sda
  partprobe
  pvdisplay
  pvcreate /dev/sda3
  vgdisplay
  vgextend centos /dev/sda3
  lvdisplay
  lvcreate -L 3.31G -n manue1 centos
  mkfs.xfs /dev/centos/manue1
  lvremove -f /dev/centos/manue1
  lvextend -l +100%FREE /dev/centos/root
  df -Th
  xfs_growfs /dev/centos/root
</p>
</div>
</div>
<div id="outline-container-orgec89bce" class="outline-2">
<h2 id="orgec89bce">ubuntu15.04 wifi 热点共享</h2>
<div class="outline-text-2" id="text-orgec89bce">
<ul class="org-ul">
<li><p>
1.下载
</p>

<p>
在 ubuntu 软件中心搜索 kde nm connection
</p></li>

<li>2.配置</li>
</ul>
<p class="verse">
kde5-nm-connection-editor<br />
跳出连接编辑器的图形界面 在图形界面点击<br />
添加&#x2013;&gt;Wireless(shared)<br />
弹出 New Connection (New 802-11-wireless connection)图形界面<br />
Connection name:更改为 mywifi(默认为 New 802-11-wireless connection)<br />
SSID:更改为 mywifi(默认为 my_shared_connection)<br />
模式:选择 Access Point<br />
Restrict to device:选择你的无线网卡<br />
点击无线安全选项卡<br />
安全:选择 WPA &amp; WPA2 Personal<br />
密码:填入你要设置的密码(至少 8 位)<br />
</p>
<ul class="org-ul">
<li>3.连接</li>
</ul>
<p class="verse">
我们点击最上方网络管理的图标，选择 连接到隐藏的 Wi-Fi 网络<br />
Wifi 适配器:选择我们设置了的无线网络<br />
连接:选择我们刚刚建立的连接名称(mywifi)<br />
之后网络名称(SSID)，Wi-Fi 安全性,密码会自动填写并变成灰色<br />
点击确定<br />
</p>
</div>
</div>
</div>
</body>
</html>